cami/Adafruit_nRF52_Arduino/libraries/BG96_LibForArduino/src/NectisCellular.cpp
        delay(100);

        if (sw.ElapsedMilliseconds() >= 10000) {
            DEBUG_PRINTLN("ElapsedMilliseconds");
            return RET_ERR(false, E_UNKNOWN);
        }
    }
    DEBUG_PRINTLN("");

    if (!_AtSerial.WriteCommandAndReadResponse("ATE0", "^OK$", 500, NULL))
        return RET_ERR(false, E_UNKNOWN);
    _AtSerial.SetEcho(false);

//#ifndef ARDUINO_ARCH_STM32
//    if (!_AtSerial.WriteCommandAndReadResponse("AT+IFC=2,2", "^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
//#endif // ARDUINO_ARCH_STM32

#if defined NRF52840_XXAA
    switch (_AccessTechnology) {
        case ACCESS_TECHNOLOGY_NONE:
            break;
        case ACCESS_TECHNOLOGY_LTE_M1:
            if (!_AtSerial.WriteCommandAndReadResponse("AT+QCFG=\"nwscanseq\",02,1", "^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
            if (!_AtSerial.WriteCommandAndReadResponse("AT+QCFG=\"nwscanmode\",3,1", "^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
            if (!_AtSerial.WriteCommandAndReadResponse("AT+QCFG=\"iotopmode\",0,1", "^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
            if (!_AtSerial.WriteCommandAndReadResponse("AT+QCFG=\"band\",F,20000,0,1", "^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
            break;
        case ACCESS_TECHNOLOGY_LTE_NB1:
            if (!_AtSerial.WriteCommandAndReadResponse("AT+QCFG=\"nwscanseq\",03,1", "^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
            if (!_AtSerial.WriteCommandAndReadResponse("AT+QCFG=\"nwscanmode\",3,1", "^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
            if (!_AtSerial.WriteCommandAndReadResponse("AT+QCFG=\"iotopmode\",1,1", "^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
            // ToDO: Set the right band for NB-IoT
            // if (!_AtSerial.WriteCommandAndReadResponse("AT+QCFG=\"nb1/bandprior\",12", "^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
            break;
        default:
            return RET_ERR(false, E_UNKNOWN);
    }
#endif // NRF52840_XXAA

#if defined NECTIS_DEBUG
    sw.Restart();
    bool cpinReady;

    while (true) {
        _AtSerial.WriteCommand("AT+CPIN?");
        cpinReady = false;

        while (true) {
            if (!_AtSerial.ReadResponse("^(OK|\\+CPIN: READY|\\+CME ERROR: .*)$", 500, &response)) return RET_ERR(false, E_UNKNOWN);
            if (response == "+CPIN: READY") {
            cpinReady = true;
            continue;
            }
            break;
        }
        if (response == "OK" && cpinReady) break;

        if (sw.ElapsedMilliseconds() >= 10000) return RET_ERR(false, E_UNKNOWN);
        delay(POLLING_INTERVAL);
    }
#endif

#if defined NRF52840_XXAA
    sw.Restart();
    while (true) {
        int status;

        _AtSerial.WriteCommand("AT+CEREG?");
        if (!_AtSerial.ReadResponse("^\\+CEREG: (.*)$", 500, &response)) return RET_ERR(false, E_UNKNOWN);
        parser.Parse(response.c_str());

        if (parser.Size() < 2) return RET_ERR(false, E_UNKNOWN);
        //resultCode = atoi(parser[0]);
        status = atoi(parser[1]);

        if (!_AtSerial.ReadResponse("^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
        if (0 <= status && status <= 5 && status != 4) break;
        if (sw.ElapsedMilliseconds() >= 10000) return RET_ERR(false, E_UNKNOWN);

        delay(POLLING_INTERVAL);
    }
#endif

    return RET_OK(true);
}

bool NectisCellular::TurnOff() {
    return _Wio.TurnOff();
}

int NectisCellular::GetIMEI(char *imei, int imeiSize){
    return _Wio.GetIMEI(imei, imeiSize);
}

int NectisCellular::GetIMSI(char *imsi, int imsiSize){
    return _Wio.GetIMSI(imsi, imsiSize);
}

int NectisCellular::GetICCID(char *iccid, int iccidSize){
    return _Wio.GetICCID(iccid, iccidSize);
}

int NectisCellular::GetPhoneNumber(char *number, int numberSize){
    return _Wio.GetPhoneNumber(number, numberSize);
}

int NectisCellular::GetReceivedSignalStrength() {
    std::string response;
    ArgumentParser parser;

    _AtSerial.WriteCommand("AT+CSQ");
    if (!_AtSerial.ReadResponse("^\\+CSQ: (.*)$", 500, &response))
        return RET_ERR(INT_MIN, E_UNKNOWN);

    parser.Parse(response.c_str());
    if (parser.Size() != 2)
        return RET_ERR(INT_MIN, E_UNKNOWN);
    int rssi = atoi(parser[0]);

    if (!_AtSerial.ReadResponse("^OK$", 500, NULL))
        return RET_ERR(INT_MIN, E_UNKNOWN);

    if (rssi == INT_MIN) {
        Serial.println("### ERROR! ###");
        delay(5000);
    }

    if (rssi == 0)
        return RET_OK(-113);
    else if (rssi == 1)
        return RET_OK(-111);
    else if (2 <= rssi && rssi <= 30)
        return RET_OK((int)LINEAR_SCALE((double)rssi, 2, 30, -109, -53));
    else if (rssi == 31)
        return RET_OK(-51);
    else if (rssi == 99)
        return RET_OK(-999);

    return RET_OK(-999);
}

bool NectisCellular::GetTime(struct tm *tim) {
    return _Wio.GetTime(tim);
}

#if defined NRF52840_XXAA
void NectisCellular::SetAccessTechnology(AccessTechnologyType technology) {
    _AccessTechnology = technology;
}
#endif // NRF52840_XXAA

void NectisCellular::SetSelectNetwork(SelectNetworkModeType mode, const char *plmn) {
    _SelectNetworkMode = mode;
    _SelectNetworkPLMN = plmn;
}

bool NectisCellular::WaitForCSRegistration(long timeout) {
    return _Wio.WaitForCSRegistration(timeout);
}

bool NectisCellular::WaitForPSRegistration(long timeout) {
    return _Wio.WaitForPSRegistration(timeout);
}

bool NectisCellular::Activate(const char *accessPointName, const char *userName, const char *password, long waitForRegistTimeout) {
    std::string response;
    ArgumentParser parser;
    Stopwatch sw;

    if (!WaitForPSRegistration(0)) {
        StringBuilder str_apn;
        if (!str_apn.WriteFormat("AT+CGDCONT=1, \"IP\", \"%s\"", accessPointName))
            return RET_ERR(false, E_UNKNOWN);
        if (!_AtSerial.WriteCommandAndReadResponse(str_apn.GetString(), "^OK$", 500, NULL))
            return RET_ERR(false, E_UNKNOWN);

        // When you would like to start to communicate with SORACOM,
        // it is faster to to set [IP, accessPointName] than to set [accessPointName, userName, password].
//        StringBuilder str;
//        if (!str.WriteFormat("AT+QICSGP=1,1,\"%s\",\"%s\",\"%s\",3", accessPointName, userName, password))
//            return RET_ERR(false, E_UNKNOWN);
//        if (!_AtSerial.WriteCommandAndReadResponse(str.GetString(), "^OK$", 500, NULL))
//            return RET_ERR(false, E_UNKNOWN);

        sw.Restart();

        switch (_SelectNetworkMode) {
            case SELECT_NETWORK_MODE_NONE:
                break;
            case SELECT_NETWORK_MODE_AUTOMATIC:
                if (!_AtSerial.WriteCommandAndReadResponse("AT+COPS=0", "^OK$", waitForRegistTimeout, NULL))
                    return RET_ERR(false, E_UNKNOWN);
                break;
            case SELECT_NETWORK_MODE_MANUAL_IMSI: {
                char imsi[15 + 1];
                if (GetIMSI(imsi, sizeof(imsi)) < 0)
                    return RET_ERR(false, E_UNKNOWN);
                if (strlen(imsi) < 4)
                    return RET_ERR(false, E_UNKNOWN);
                StringBuilder str;
                if (!str.WriteFormat("AT+COPS=1,2,\"%.5s\"", imsi))
                    return RET_ERR(false, E_UNKNOWN);
                if (!_AtSerial.WriteCommandAndReadResponse(str.GetString(), "^OK$", waitForRegistTimeout, NULL))
                    return RET_ERR(false, E_UNKNOWN);
                break;
            }
            case SELECT_NETWORK_MODE_MANUAL: {
                if (_SelectNetworkPLMN.size() <= 0)
                    return RET_ERR(false, E_UNKNOWN);
                StringBuilder str;
                if (!str.WriteFormat("AT+COPS=1,2,\"%s\"", _SelectNetworkPLMN.c_str()))
                    return RET_ERR(false, E_UNKNOWN);
                if (!_AtSerial.WriteCommandAndReadResponse(str.GetString(), "^OK$", waitForRegistTimeout, NULL))
                    return RET_ERR(false, E_UNKNOWN);
                break;
            }
            default:
                return RET_ERR(false, E_UNKNOWN);
        }

        if (!WaitForPSRegistration(waitForRegistTimeout))
            return RET_ERR(false, E_UNKNOWN);

        // For debug.
#ifdef NECTIS_DEBUG
        char dbg[100];
        sprintf(dbg, "Elapsed time is %lu[msec.].", sw.ElapsedMilliseconds());
        DEBUG_PRINTLN(dbg);

        _AtSerial.WriteCommandAndReadResponse("AT+CREG?", "^OK$", 500, NULL);
        _AtSerial.WriteCommandAndReadResponse("AT+CGREG?", "^OK$", 500, NULL);
#if defined NRF52840_XXAA
        _AtSerial.WriteCommandAndReadResponse("AT+CEREG?", "^OK$", 500, NULL);
#endif // NRF52840_XXAA
#endif // NECTIS_DEBUG
    }

    sw.Restart();
    while (true) {
        _AtSerial.WriteCommand("AT+QIACT=1");
        if (!_AtSerial.ReadResponse("^(OK|ERROR)$", 150000, &response))
            return RET_ERR(false, E_UNKNOWN);
        if (response == "OK")
            break;
        if (!_AtSerial.WriteCommandAndReadResponse("AT+QIGETERROR", "^OK$", 500, NULL))
            return RET_ERR(false, E_UNKNOWN);
        if (sw.ElapsedMilliseconds() >= 150000)
            return RET_ERR(false, E_UNKNOWN);
        delay(POLLING_INTERVAL);
    }

    // For debug.
#ifdef NECTIS_DEBUG
    if (!_AtSerial.WriteCommandAndReadResponse("AT+QIACT?", "^OK$", 150000, NULL))
        return RET_ERR(false, E_UNKNOWN);
#endif // NECTIS_DEBUG

    return RET_OK(true);
}

bool NectisCellular::Deactivate() {
    return _Wio.Deactivate();
}

bool NectisCellular::GetDNSAddress(IPAddress *ip1, IPAddress *ip2) {
    return _Wio.GetDNSAddress(ip1, ip2);
}

bool NectisCellular::SetDNSAddress(const IPAddress &ip1) {
    return _Wio.SetDNSAddress(ip1);
}

bool NectisCellular::SetDNSAddress(const IPAddress &ip1, const IPAddress &ip2) {
    return _Wio.SetDNSAddress(ip1, ip2);
}

int NectisCellular::SocketOpen(const char *host, int port, SocketType type){
    return _Wio.SocketOpen(host, port, (WioCellular::SocketType)type);
}

