cami/Adafruit_nRF52_Arduino/libraries/BG96_LibForArduino/src/NectisCellular.cpp
bool NectisCellular::SocketSend(int connectId, const byte *data, int dataSize){
    return _Wio.SocketSend(connectId, data, dataSize);
}

bool NectisCellular::SocketSend(int connectId, const char *data){
    return _Wio.SocketSend(connectId, data);
}

int NectisCellular::SocketReceive(int connectId, byte *data, int dataSize){
    return _Wio.SocketReceive(connectId, data, dataSize);
}

int NectisCellular::SocketReceive(int connectId, byte *data, int dataSize, long timeout){
    return _Wio.SocketReceive(connectId, data, dataSize, timeout);
}

int NectisCellular::SocketReceive(int connectId, char *data, int dataSize){
    return _Wio.SocketReceive(connectId, data, dataSize);
}

int NectisCellular::SocketReceive(int connectId, char *data, int dataSize, long timeout){
    return _Wio.SocketReceive(connectId, data, dataSize,timeout);
}

bool NectisCellular::SocketClose(int connectId){
    return _Wio.SocketClose(connectId);
}

int NectisCellular::HttpGet(const char *url, char *data, int dataSize) {
    return _Wio.HttpGet(url, data, dataSize);
}

int NectisCellular::HttpGet(const char *url, char *data, int dataSize, const WioCellularHttpHeader &header) {
    return _Wio.HttpGet(url,data,dataSize, header);
}

bool NectisCellular::HttpPost(const char *url, const char *data, int *responseCode) {
    return _Wio.HttpPost(url, data, responseCode);
}

bool NectisCellular::HttpPost(const char *url, const char *data, int *responseCode, const WioCellularHttpHeader &header) {
    return _Wio.HttpPost(url, data, responseCode, header);
}

//TODO
// bool SendUSSD(const char *in, char *out, int outSize);

bool NectisCellular::HttpPost2(const char *url, const char *data, int *responseCode , char *recv_data, int recv_dataSize) {
    return _Wio.HttpPost2(url, data, responseCode, recv_data, recv_dataSize);
}

bool NectisCellular::HttpPost2(const char *url, const char *data, int *responseCode, char *recv_data, int recv_dataSize , const WioCellularHttpHeader &header) {
    return _Wio.HttpPost2(url, data, responseCode, recv_data, recv_dataSize, header);
}


////////////////////////////////////////////////////////////////////////////////////////
// NetisCellular

void NectisCellular::SoftReset() {
    NVIC_SystemReset();
}

void NectisCellular::Bg96Begin() {
    // Initialize Uart between BL654 and BG96.
    Serial1.setPins(MODULE_UART_RX_PIN, MODULE_UART_TX_PIN, MODULE_RTS_PIN, MODULE_CTS_PIN);
    Serial1.begin(115200);

    delay(200);
}

void NectisCellular::Bg96End() {
    Serial1.end();
}

bool NectisCellular::Bg96TurnOff() {
    return TurnOff();
}

void NectisCellular::InitLteM() {
#ifdef ARDUINO_WIO_LTE_M1NB1_BG96
    SetAccessTechnology(ACCESS_TECHNOLOGY_LTE_M1);
    SetSelectNetwork(SELECT_NETWORK_MODE_MANUAL_IMSI);
#endif

    Serial.println("### Turn on or reset.");
    if (!TurnOnOrReset()) {
        Serial.println("### ERROR!; TurnOnOrReset ###");
        return;
    }

    delay(100);
    Serial.println("### Connecting to \"" APN "\".");
    if (!Activate(APN, USERNAME, PASSWORD)) {
        Serial.println("### ERROR!; Activate ###");
        return;
    }
}

int NectisCellular::GetReceivedSignalStrengthIndicator() {
    int rssi = GetReceivedSignalStrength();
    int rssi_count = 0;
    while (rssi == - 999) {
        rssi = GetReceivedSignalStrength();
        if (rssi_count == 10) {
            SoftReset();
        }
        rssi_count++;
        delay(1000);
    }

    return rssi;
}

bool NectisCellular::IsTimeGot(struct tm *tim) {
    std::string response;
    
    // AT+QLTS=1 -> Acquire UTC
    // AT+QLTS=2 -> Acquire JST
    _AtSerial.WriteCommand("AT+QLTS=2");
    
    if (!_AtSerial.ReadResponse("^\\+QLTS: (.*)$", 500, &response)) return RET_ERR(false, E_UNKNOWN);
    if (!_AtSerial.ReadResponse("^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
    
    if (strlen(response.c_str()) != 26) return RET_ERR(false, E_UNKNOWN);
    
    const char* parameter = response.c_str();
    
    if (parameter[0] != '"') return RET_ERR(false, E_UNKNOWN);
    if (parameter[5] != '/') return RET_ERR(false, E_UNKNOWN);
    if (parameter[8] != '/') return RET_ERR(false, E_UNKNOWN);
    if (parameter[11] != ',') return RET_ERR(false, E_UNKNOWN);
    if (parameter[14] != ':') return RET_ERR(false, E_UNKNOWN);
    if (parameter[17] != ':') return RET_ERR(false, E_UNKNOWN);
    if (parameter[23] != ',') return RET_ERR(false, E_UNKNOWN);
    if (parameter[25] != '"') return RET_ERR(false, E_UNKNOWN);
    
    tim->tm_year = atoi(&parameter[1]) - 1900;
    tim->tm_mon = atoi(&parameter[6]) - 1;
    tim->tm_mday = atoi(&parameter[9]);
    tim->tm_hour = atoi(&parameter[12]);
    tim->tm_min = atoi(&parameter[15]);
    tim->tm_sec = atoi(&parameter[18]);
    tim->tm_wday = 0;
    tim->tm_yday = 0;
    tim->tm_isdst = 0;
    
    // Update tm_wday and tm_yday
    mktime(tim);
    
    return RET_OK(true);
}

void NectisCellular::GetCurrentTime(struct tm *tim) {
    // Get time in JST.
    while (!IsTimeGot(tim)) {
        Serial.println("### ERROR! ###");
        delay(5000);
    }
}

void NectisCellular::PostDataViaHttp(char *post_data) {
    Serial.println("### Post.");
    Serial.print("Post:");
    Serial.print(post_data);
    Serial.println("");
    
    WioCellularHttpHeader header;
    header["Accept"] = "*/*";
    header["User-Agent"] = HTTP_USER_AGENT;
    header["Connection"] = "Keep-Alive";
    header["Content-Type"] = HTTP_CONTENT_TYPE;
    
    int status;
    if (!HttpPost(ENDPOINT_URL, post_data, &status, header)) {
        Serial.println("### ERROR! ###");
        goto err;
    }
    Serial.print("Status:");
    Serial.println(status);

err:
    Serial.println("### Wait.");
    delay(INTERVAL);
}

void NectisCellular::PostDataViaUdp(char *post_data) {
    Serial.println("### Open.");
    int connectId;
    connectId = SocketOpen("uni.soracom.io", 23080, NECTIS_UDP);
    if (connectId < 0) {
        Serial.println("### ERROR! ###");
        goto err;
    }
    
    Serial.println("### Send.");
    Serial.print("Send:");
    Serial.print(post_data);
    Serial.println("");
    if (!SocketSend(connectId, post_data)) {
        Serial.println("### ERROR! ###");
        goto err_close;
    }
    
    Serial.println("### Receive.");
    int length;
    length = SocketReceive(connectId, post_data, sizeof(post_data), RECEIVE_TIMEOUT);
    if (length < 0) {
        Serial.println("### ERROR! ###");
        Serial.println(length);
        goto err_close;
    }
    if (length == 0) {
        Serial.println("### RECEIVE TIMEOUT! ###");
        goto err_close;
    }
    Serial.print("Receive:");
    Serial.print(post_data);
    Serial.println("");

err_close:
    Serial.println("### Close.");
    if (!SocketClose(connectId)) {
        Serial.println("### ERROR! ###");
        goto err;
    }

err:
    delay(INTERVAL);
}

