cami/Adafruit_nRF52_Arduino/libraries/BG96_LibForArduino/src/NectisCellular.cpp
void NectisCellular::PostDataViaUdp(char *post_data, int data_length) {
    Serial.println("### Open.");
    int connectId;
    connectId = SocketOpen("uni.soracom.io", 23080, NECTIS_UDP);
    if (connectId < 0) {
        Serial.println("### ERROR! ###");
        goto err;
    }
    
    Serial.println("### Send.");
    Serial.print("Send:");
    Serial.print(post_data);
    Serial.println("");
    if (!SocketSend(connectId, (const byte *)post_data, data_length)) {
        Serial.println("### ERROR! ###");
        goto err_close;
    }
    
    Serial.println("### Receive.");
    int length;
    length = SocketReceive(connectId, post_data, data_length, RECEIVE_TIMEOUT);
    if (length < 0) {
        Serial.println("### ERROR! ###");
        Serial.println(length);
        goto err_close;
    }
    if (length == 0) {
        Serial.println("### RECEIVE TIMEOUT! ###");
        goto err_close;
    }
    Serial.print("Receive:");
    Serial.print(post_data);
    Serial.println("");

err_close:
    Serial.println("### Close.");
    if (!SocketClose(connectId)) {
        Serial.println("### ERROR! ###");
        goto err;
    }

err:
    delay(INTERVAL);
}

void NectisCellular::GetBg96UfsStorageSize() {
    // +QFLDS: 12883392,14483456
    // The freesize is 12883392 byte, the total_size is 14483456 byte.
    _AtSerial.WriteCommandAndReadResponse("AT+QFLDS=\"UFS\"", "^OK$", 500, NULL);
    _AtSerial.WriteCommandAndReadResponse("AT+QFUPL=?", "^OK$", 500, NULL);
}

void NectisCellular::ListBg96UfsFileInfo() {
    _AtSerial.WriteCommandAndReadResponse("AT+QFLST", "^OK$", 500, NULL);
}

bool NectisCellular::UploadFilesToBg96(const char* filename, unsigned int filesize) {
    StringBuilder str;

    Serial.println(filename);
    if (!str.WriteFormat("AT+QFUPL=\"%s\",%u,60000,1", filename, filesize))
        return RET_ERR(false, E_UNKNOWN);
    _AtSerial.WriteCommand(str.GetString());
    if (!_AtSerial.ReadResponse("CONNECT", 60000, NULL))
        return RET_ERR(false, E_UNKNOWN);

    return true;
}

//void NectisCellular::DeleteBg96UfsFiles() {
//    _AtSerial.WriteCommandAndReadResponse("AT+QFDEL=\"*\"", "^OK$", 500, NULL);
//}
